const XX花 = [
    '木槿花', '瑞香花', '午时花', '蓝雪花', '星辰花', '隐卷花', '紫藤花', '冰凌花', '大王花', '茜草花',
    '珊瑚花', '金盏花', '海仙花', '翠雀花', '小丽花', '金银花', '金莲花', '火鹤花', '金铃花', '提灯花', 
    '水莲花', '蓝星花', '雪滴花', '蓝钟花', '棣棠花', '彼岸花', '锦带花', '蓝铃花', '蝶豆花', '六出花', 
    '水塔花', '玉簪花', '悬铃花', '醉蝶花', '紫阳花', '玉叶金花', 
]
const XX草 = [
    '四叶草', '薰衣草', '鬼针草', '蝴蝶草', '风铃草', '蓝眼草', '金鱼草', '蓝堇草', '夕雾草', '独尾草',
    '月见草', '狼尾草', '风车草', '薄雪草', '灯芯草', '紫露草', '夏枯草', '捕蝇草', '萱草', '香草',
    '忘忧草', '箭羽草', '含羞草'
]
const XX香 = [
    '迷迭香', '夜来香', '郁金香', '百里香', '结香', '丁香', 
]
const XX莲 = [
    '红莲', '银莲', '雪莲', '睡莲', '锡兰莲', '樱莲', '灯台莲', '铁线莲', '金线莲', '西番莲', 
    '雪片莲', '观音莲', '百子莲', '旱金莲', '半边莲',
]
const XX兰 = [
    '剑兰', '铃兰', '木兰', '球兰', '紫罗兰', '龙舌兰', '君子兰', '鹤望兰', '白芨兰', '小苍兰',
    '香雪兰', '蝴蝶兰', '五唇兰', '鹤顶兰', '文心兰', '水晶兰', '翡翠兰', 
]
const XX菊 = [
    '雏菊', '甘菊', '幌菊', '蓝眼菊', '万寿菊', '白晶菊', '金盏菊', '蛇目菊', '鳞叶菊', '银叶菊',
    '矢车菊',
]
const XX梅 = [
    '梅', '寒梅', '杨梅', '五色梅', '紫竹梅', '珍珠梅', '金缕梅', 
]
const XX藤 = [
    '紫藤', '穗叶藤', '清风藤', '络石藤', '忍冬藤',
]
const XX竹 = [
    '石竹', '文竹', '松竹', '海石竹', '南天竹',
]
const XX菜 = [
    '千屈菜', '岩白菜', '茅膏菜', 
]
const XX堇 = [
    '紫堇', '角堇', '三色堇', '捕虫堇',
]
const XX松 = [
    '红松', '雪松', '海松', '南天松', '蓬莱松',
]
const XX子 = [
    '栀子', '风信子', '茶藨子', '寒丁子',
]
const XX木 = [
    '六道木', '金莲木', '水红木', 
]
const 复合名 = [
    '麝香百合', '水仙百合', '细叶百合', '宫灯百合', '卷丹百合', 
    '星风铃', '碟风铃', '天山雪莲', '露珠杜鹃', '沙地玫瑰',
    '四季秋海棠', '玫瑰荚蒾', '羽衣甘蓝', '叶杜丹'
]

// Creep名称表
export const FlowerNames = [
    ...XX花, ...XX草, ...XX香, ...XX莲, ...XX兰, ...XX菊, ...XX梅,
    ...XX藤, ...XX竹, ...XX菜, ...XX堇, ...XX松, ...XX子, ...XX木,
    ...复合名,
    '杜鹃', '鸢尾', '石蒜', '曼珠沙华', '月桂', '满天星', '茉莉', '玫瑰', '紫薇',
    '百合', '蔷薇', '石楠', '曼陀罗', '勿忘我', '槲寄生', '康乃馨', 
    '向日葵', '罂粟', '银杏', '樱', '薄荷', '白芷',
    '月季', '香樟',  '含笑', '一品红', '牡丹', '海棠', '天门冬',  
    '银合欢', '金合欢',  '桔梗', '紫菀', '溪苏', '棕榈', '水仙', 
    '白茶', '忍冬', '半夏', '灵仙', '莳萝', '木槿', '延胡索', '荚蒾', '山茶', 
    '扶桑', '朱槿', '红菖蒲', '木芙蓉', '千日红', '穗花杉', '秋海棠', 
    '晚香玉', '虞美人', '荆芥', '碧冬茄',  '金丝桃', '黄刺玫', '菊苣', '蓝花丹', '四季樱',
    '天竺葵', '古柯', '红花槐', '蓝绣球', '狸藻', '菖蒲', '石刁柏', '朱顶红', '红枫',
    '梧桐', '红豆杉', '万年青', '白千层', '桃金娘', '金丝楠', '滴水观音', 
    '天南星', '秋水仙', '蓝莓', '龙珠果', '食虫植物', '露叶毛毡苔', '貉藻', '无花果', 
     '剪秋罗', '蒲公英', '蓝花楹', '棣棠', '流苏树', '剪春罗', '香蒲', 
    '冬青', '千叶蓍', '石斛', '山茱萸', '溪荪', '紫荆', '鬼箭羽', '雾冰玉', '琉璃苣', '青檀', 
]